cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "I am a brown cat!!!!"], ["updated_at", "2019-01-30 00:19:25.982591"], ["id", 2]]